Catalogs/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыДоговоров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораОбратный</Name>
					<Comment>Вид договора при взаимном документообороте</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
			<Comment>Виды договоров</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
					<Comment>Договоры с поставщиками</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Договоры с покупателями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комиссия</Name>
					<Comment>Договор комиссии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бонус</Name>
					<Comment>Договор начисления бонусов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Общий договор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпрощеннаяКомиссия</Name>
					<Comment>Упрощенная комиссия</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бартерный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыДоговоров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда



#Область ОбновлениеИнформационнойБазы

Процедура НачальноеЗаполнение() Экспорт
	
	спОбъект = Справочники.ВидыДоговоров.Аренда.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);
	
	спОбъект = Справочники.ВидыДоговоров.БанковскийСчет.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Бонус.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Бонус;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);
	
	спОбъект = Справочники.ВидыДоговоров.БухгалтерскаяКомиссияПоставка.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Покупка;
	спОбъект.ВидДоговораОбратный = Справочники.ВидыДоговоров.БухгалтерскаяКомиссияПродажа;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);
	
	спОбъект = Справочники.ВидыДоговоров.БухгалтерскаяКомиссияПродажа.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
	спОбъект.ВидДоговораОбратный = Справочники.ВидыДоговоров.БухгалтерскаяКомиссияПоставка;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);
	
	спОбъект = Справочники.ВидыДоговоров.БухгалтерскиеУслуги.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.ВозвратнаяТара.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
		
	спОбъект = Справочники.ВидыДоговоров.ВыполнениеНИОКР.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Госорганы.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	

	спОбъект = Справочники.ВидыДоговоров.ЗаймКредитГарантии.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.ПеремещениеДС.ПолучитьОбъект();
	спОбъект.Наименование = "Инкассация  ДС";
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.КомиссияПоставка.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Комиссия;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	

	спОбъект = Справочники.ВидыДоговоров.КомиссияПродажа.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Комиссия;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Консалтинг.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	

	спОбъект = Справочники.ВидыДоговоров.Маркетинг.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Обучение.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Охрана.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Перевозка.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.ПодборПерсонала.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Подписка.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Подряд.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Поставка.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Покупка;
	спОбъект.ВидДоговораОбратный = Справочники.ВидыДоговоров.Продажа;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Продажа.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
	спОбъект.ВидДоговораОбратный = Справочники.ВидыДоговоров.Поставка;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.ПоставкаПереводДолга.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Покупка;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.ПродажаМобильныхПополнений.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.ПродажаПоКартам.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Прочее.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Ссуда.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Страхование.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Субаренда.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.ТранспортноеЭкспедирование.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	

	спОбъект = Справочники.ВидыДоговоров.УпрощеннаяКомиссия.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.УпрощеннаяКомиссия;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Хранение.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.ЮридическиеУслуги.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	

	
КонецПроцедуры


#КонецОбласти


#КонецЕсли
